; domain
(define (domain drone-domain)
    (:requirements :strips :typing :action-costs)
    (:types
        object
        dron caja person transportador - object  ; Corrección de jerarquía de tipos
        location
        content
        num
    )   

    (:functions
        (total-cost)            ; Coste acumulado del plan
        (fly-cost ?from ?to - location)  ; Coste específico entre localizaciones
    )

    (:predicates
        ;; ubicación de drones, cajas, personas y transportadores
        (at ?o - object ?l - location)

        ;; carga en dron
        (en-dron ?c - caja ?d - dron)
        (brazo-libre ?d - dron)

        ;; carga en transportador
        (cajas-en ?t - transportador ?n - num)
        (siguiente-t ?t - transportador ?n1 ?n2 - num)
        (llevado-por ?d - dron ?t - transportador)


        ;; contenidos y necesidades
        (contenido-caja ?c - caja ?t - content)
        (en-transportador ?c - caja ?t - transportador)
        (person-needs ?p - person ?t - content)
        (person-has ?p - person ?t - content)
    )

    ; Acciones
  
    (:action mover-dron
        :parameters (?d - dron ?from - location ?to - location)
        :precondition (at ?d ?from)
        :effect (and
            (not (at ?d ?from))
            (at ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )
    (:action cargar_dron
        :parameters (?d - dron ?c - caja ?l - location)
        :precondition (and 
            (at ?d ?l)
            (at ?c ?l)
            (brazo-libre ?d)
        )       
        :effect (and
            (not (at ?c ?l))
            (en-dron ?c ?d)
            (not (brazo-libre ?d))
        )
    )

    (:action entregar   
        :parameters (?p - person ?c - caja ?content - content ?l - location ?d - dron)
        :precondition (and 
            (at ?p ?l)
            (at ?d ?l)
            (en-dron ?c ?d)
            (contenido-caja ?c ?content)
            (person-needs ?p ?content)
        )       
        :effect (and
            (not (en-dron ?c ?d))
            (person-has ?p ?content)
            (brazo-libre ?d)
            (not (person-needs ?p ?content))
        )
    )

    (:action poner-caja-en-transportador
        :parameters (?d - dron ?t - transportador ?c - caja ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at ?d ?l)
            (at ?t ?l)
            (en-dron ?c ?d)
            (cajas-en ?t ?n1)
            (siguiente-t ?t ?n1 ?n2)
        )
        :effect (and
            (not (en-dron ?c ?d))
            (not (cajas-en ?t ?n1))
            (cajas-en ?t ?n2)
            (en-transportador ?c ?t)
            (brazo-libre ?d)
        
            
        )
    )
    (:action coger-transportador
        :parameters (?d - dron ?t - transportador ?l - location)
        :precondition (and
            (at ?d ?l)
            (at ?t ?l)
            (brazo-libre ?d)
        )
        :effect (and
            (not (brazo-libre ?d))
            (not (at ?t ?l))
            (llevado-por ?d ?t)
            
        )
    )
    (:action dejar-transportador
        :parameters (?d - dron ?t - transportador ?l - location)
        :precondition (and
            (at ?d ?l)
            (llevado-por ?d ?t)
        )
        :effect (and
            (brazo-libre ?d)
            (not(llevado-por ?d ?t))
            (at ?t ?l)
        )
    )

    (:action mover-transportador
        :parameters (?d - dron ?t - transportador ?from - location ?to - location)
        :precondition (and
            (at ?d ?from)
            (llevado-por ?d ?t)
            
        )
        :effect (and
            (not (at ?d ?from))
            (at ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    (:action sacar-caja-del-transportador
        :parameters (?d - dron ?t - transportador ?c - caja ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at ?t ?l)
            (at ?d ?l)
            (en-transportador ?c ?t)
            (cajas-en ?t ?n2)
            (siguiente-t ?t ?n1 ?n2)
            (brazo-libre ?d)


        )
        :effect (and
            (not (cajas-en ?t ?n2))
            (cajas-en ?t ?n1)
            (not (en-transportador ?c ?t))
            (en-dron ?c ?d)            
            (not (brazo-libre ?d))
            )
    )
)

; problem
(define (problem drone_problem_d1_r1_l7_p7_c7_g7_ct2)
  (:domain drone-domain)
  (:objects
    dron1 - dron
    carrier1 - transportador
    deposito - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    crate1 - caja
    crate2 - caja
    crate3 - caja
    crate4 - caja
    crate5 - caja
    crate6 - caja
    crate7 - caja
    comida - content
    medicina - content
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    n0 - num
    n1 - num
    n2 - num
    n3 - num
    n4 - num
  )

  (:init
    (at dron1 deposito)
    (at carrier1 deposito)
    (at crate1 deposito)
    (at crate2 deposito)
    (at crate3 deposito)
    (at crate4 deposito)
    (at crate5 deposito)
    (at crate6 deposito)
    (at crate7 deposito)
    (contenido-caja crate1 comida)
    (contenido-caja crate2 comida)
    (contenido-caja crate3 comida)
    (contenido-caja crate4 comida)
    (contenido-caja crate5 comida)
    (contenido-caja crate6 medicina)
    (contenido-caja crate7 medicina)
    (at person1 loc5)
    (at person2 loc7)
    (at person3 loc6)
    (at person4 loc5)
    (at person5 loc1)
    (at person6 loc7)
    (at person7 loc5)
    (person-needs person1 comida)
    (person-needs person1 medicina)
    (person-needs person2 comida)
    (person-needs person3 comida)
    (person-needs person5 comida)
    (person-needs person7 comida)
    (person-needs person7 medicina)
    (brazo-libre dron1)
    (siguiente-t carrier1 n0 n1)
    (siguiente-t carrier1 n1 n2)
    (siguiente-t carrier1 n2 n3)
    (siguiente-t carrier1 n3 n4)
    (cajas-en carrier1 n0)
	(= (total-cost) 0 )
	(= (fly-cost deposito deposito) 0)
	(= (fly-cost deposito loc1) 111)
	(= (fly-cost deposito loc2) 219)
	(= (fly-cost deposito loc3) 175)
	(= (fly-cost deposito loc4) 93)
	(= (fly-cost deposito loc5) 84)
	(= (fly-cost deposito loc6) 191)
	(= (fly-cost deposito loc7) 178)
	(= (fly-cost loc1 deposito) 111)
	(= (fly-cost loc1 loc1) 0)
	(= (fly-cost loc1 loc2) 129)
	(= (fly-cost loc1 loc3) 83)
	(= (fly-cost loc1 loc4) 54)
	(= (fly-cost loc1 loc5) 54)
	(= (fly-cost loc1 loc6) 140)
	(= (fly-cost loc1 loc7) 187)
	(= (fly-cost loc2 deposito) 219)
	(= (fly-cost loc2 loc1) 129)
	(= (fly-cost loc2 loc2) 0)
	(= (fly-cost loc2 loc3) 47)
	(= (fly-cost loc2 loc4) 127)
	(= (fly-cost loc2 loc5) 136)
	(= (fly-cost loc2 loc6) 78)
	(= (fly-cost loc2 loc7) 175)
	(= (fly-cost loc3 deposito) 175)
	(= (fly-cost loc3 loc1) 83)
	(= (fly-cost loc3 loc2) 47)
	(= (fly-cost loc3 loc3) 0)
	(= (fly-cost loc3 loc4) 84)
	(= (fly-cost loc3 loc5) 93)
	(= (fly-cost loc3 loc6) 81)
	(= (fly-cost loc3 loc7) 164)
	(= (fly-cost loc4 deposito) 93)
	(= (fly-cost loc4 loc1) 54)
	(= (fly-cost loc4 loc2) 127)
	(= (fly-cost loc4 loc3) 84)
	(= (fly-cost loc4 loc4) 0)
	(= (fly-cost loc4 loc5) 10)
	(= (fly-cost loc4 loc6) 107)
	(= (fly-cost loc4 loc7) 135)
	(= (fly-cost loc5 deposito) 84)
	(= (fly-cost loc5 loc1) 54)
	(= (fly-cost loc5 loc2) 136)
	(= (fly-cost loc5 loc3) 93)
	(= (fly-cost loc5 loc4) 10)
	(= (fly-cost loc5 loc5) 0)
	(= (fly-cost loc5 loc6) 116)
	(= (fly-cost loc5 loc7) 139)
	(= (fly-cost loc6 deposito) 191)
	(= (fly-cost loc6 loc1) 140)
	(= (fly-cost loc6 loc2) 78)
	(= (fly-cost loc6 loc3) 81)
	(= (fly-cost loc6 loc4) 107)
	(= (fly-cost loc6 loc5) 116)
	(= (fly-cost loc6 loc6) 0)
	(= (fly-cost loc6 loc7) 99)
	(= (fly-cost loc7 deposito) 178)
	(= (fly-cost loc7 loc1) 187)
	(= (fly-cost loc7 loc2) 175)
	(= (fly-cost loc7 loc3) 164)
	(= (fly-cost loc7 loc4) 135)
	(= (fly-cost loc7 loc5) 139)
	(= (fly-cost loc7 loc6) 99)
	(= (fly-cost loc7 loc7) 0)
  )

  (:goal (and
    (at dron1 deposito)
    (person-has person1 comida)
    (person-has person1 medicina)
    (person-has person2 comida)
    (person-has person3 comida)
    (person-has person5 comida)
    (person-has person7 comida)
    (person-has person7 medicina)
    (at carrier1 deposito)
  ))

   (:metric minimize (total-cost))

)

; plan
1. (cargar_dron dron1 crate5 deposito)
   deleted: (at crate5 deposito) (brazo-libre dron1)
   added: (en-dron crate5 dron1)
   goals met: 2 of 9
2. (mover-dron dron1 deposito loc6)
   deleted: (at dron1 deposito)
   added: (at dron1 loc6)
   goals met: 1 of 9
3. (entregar person3 crate5 comida loc6 dron1)
   deleted: (en-dron crate5 dron1) (person-needs person3 comida)
   added: (person-has person3 comida) (brazo-libre dron1)
   goals met: 2 of 9
4. (mover-dron dron1 loc6 deposito)
   deleted: (at dron1 loc6)
   added: (at dron1 deposito)
   goals met: 3 of 9
5. (cargar_dron dron1 crate4 deposito)
   deleted: (at crate4 deposito) (brazo-libre dron1)
   added: (en-dron crate4 dron1)
   goals met: 3 of 9
6. (mover-dron dron1 deposito loc1)
   deleted: (at dron1 deposito)
   added: (at dron1 loc1)
   goals met: 2 of 9
7. (entregar person5 crate4 comida loc1 dron1)
   deleted: (en-dron crate4 dron1) (person-needs person5 comida)
   added: (person-has person5 comida) (brazo-libre dron1)
   goals met: 3 of 9
8. (mover-dron dron1 loc1 deposito)
   deleted: (at dron1 loc1)
   added: (at dron1 deposito)
   goals met: 4 of 9
9. (cargar_dron dron1 crate3 deposito)
   deleted: (at crate3 deposito) (brazo-libre dron1)
   added: (en-dron crate3 dron1)
   goals met: 4 of 9
10. (mover-dron dron1 deposito loc5)
   deleted: (at dron1 deposito)
   added: (at dron1 loc5)
   goals met: 3 of 9
11. (entregar person1 crate3 comida loc5 dron1)
   deleted: (en-dron crate3 dron1) (person-needs person1 comida)
   added: (person-has person1 comida) (brazo-libre dron1)
   goals met: 4 of 9
12. (mover-dron dron1 loc5 deposito)
   deleted: (at dron1 loc5)
   added: (at dron1 deposito)
   goals met: 5 of 9
13. (cargar_dron dron1 crate2 deposito)
   deleted: (at crate2 deposito) (brazo-libre dron1)
   added: (en-dron crate2 dron1)
   goals met: 5 of 9
14. (mover-dron dron1 deposito loc5)
   deleted: (at dron1 deposito)
   added: (at dron1 loc5)
   goals met: 4 of 9
15. (entregar person7 crate2 comida loc5 dron1)
   deleted: (en-dron crate2 dron1) (person-needs person7 comida)
   added: (person-has person7 comida) (brazo-libre dron1)
   goals met: 5 of 9
16. (mover-dron dron1 loc5 deposito)
   deleted: (at dron1 loc5)
   added: (at dron1 deposito)
   goals met: 6 of 9
17. (cargar_dron dron1 crate7 deposito)
   deleted: (at crate7 deposito) (brazo-libre dron1)
   added: (en-dron crate7 dron1)
   goals met: 6 of 9
18. (mover-dron dron1 deposito loc5)
   deleted: (at dron1 deposito)
   added: (at dron1 loc5)
   goals met: 5 of 9
19. (entregar person1 crate7 medicina loc5 dron1)
   deleted: (en-dron crate7 dron1) (person-needs person1 medicina)
   added: (person-has person1 medicina) (brazo-libre dron1)
   goals met: 6 of 9
20. (mover-dron dron1 loc5 deposito)
   deleted: (at dron1 loc5)
   added: (at dron1 deposito)
   goals met: 7 of 9
21. (cargar_dron dron1 crate6 deposito)
   deleted: (at crate6 deposito) (brazo-libre dron1)
   added: (en-dron crate6 dron1)
   goals met: 7 of 9
22. (mover-dron dron1 deposito loc5)
   deleted: (at dron1 deposito)
   added: (at dron1 loc5)
   goals met: 6 of 9
23. (entregar person7 crate6 medicina loc5 dron1)
   deleted: (en-dron crate6 dron1) (person-needs person7 medicina)
   added: (person-has person7 medicina) (brazo-libre dron1)
   goals met: 7 of 9
24. (mover-dron dron1 loc5 deposito)
   deleted: (at dron1 loc5)
   added: (at dron1 deposito)
   goals met: 8 of 9
25. (cargar_dron dron1 crate1 deposito)
   deleted: (at crate1 deposito) (brazo-libre dron1)
   added: (en-dron crate1 dron1)
   goals met: 8 of 9
26. (mover-dron dron1 deposito loc7)
   deleted: (at dron1 deposito)
   added: (at dron1 loc7)
   goals met: 7 of 9
27. (entregar person2 crate1 comida loc7 dron1)
   deleted: (en-dron crate1 dron1) (person-needs person2 comida)
   added: (person-has person2 comida) (brazo-libre dron1)
   goals met: 8 of 9
28. (mover-dron dron1 loc7 deposito)
   deleted: (at dron1 loc7)
   added: (at dron1 deposito)
   goals met: 9 of 9
